import { Rune } from '../../types/rune';

export const EmblemRuneData: Rune[] = [
  {
    name: '무자비한 포식자',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '무방비 공격 시 각성하여 20초 동안 적에게 주는 스킬 피해 55% 증가 및 모든 스킬 재사용 대기 시간 초기화(재사용 대기 시간: 90초). 상시 효과: 적에게 주는 피해 21% 증가.',
    season: 1,
  },
  {
    name: '순수한 힘',
    equipment: '엠블럼',
    grade: '전설',
    effect: '궁극기 사용 시 30초 동안 적에게 주는 피해 27% 증가. 궁극기 게이지 획득량 20% 증가.',
    season: 1,
  },
  {
    name: '부서진 하늘',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 20초 동안 연타 피해 60% 증가, 지속 중 공격 적중 시 (공격력×29%) 추가 피해(0.5초당 1회, 재사용 대기 시간: 90초). 상시 효과: 연타 피해 8%, 재사용 대기 시간 회복 속도 8% 증가.',
    season: 1,
  },
  {
    name: '인도하는 빛',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '궁극기 사용 시 자신과 15m 내 아군에게 15초 동안 공격력 8% 증가. 아군 회복 시 15초 동안 자신의 공격력 20% 증가.',
    season: 1,
  },
  {
    name: '대마법사',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 20초 동안 공격력 45%, 스킬 사용 속도/캐스팅 및 차지 속도 25% 증가(재사용 대기 시간: 90초). 상시 효과: 스킬 사용 속도/캐스팅 및 차지 속도 14%, 캐스팅/차지 스킬 피해 14% 증가.',
    season: 1,
  },
  {
    name: '흩날리는 검',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 35초 동안 공격력 35%, 기본 공격 속도 20%, 기본 공격 추가타 확률 20% 증가(재사용 대기 시간: 90초). 상시 효과: 기본 공격 속도 24%, 기본 공격 추가타 확률 24% 증가.',
    season: 1,
  },
  {
    name: '산맥 군주',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 20초 동안 강타 피해 60% 증가, 지속 중 3초마다 대상과 3m 내 적에게 (공격력×155%) 추가 피해(재사용 대기 시간: 90초). 상시 효과: 강타 피해 8%, 스킬 사용 속도 8% 증가.',
    season: 1,
  },
  {
    name: '아득한 빛',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 20초 동안 치명타 확률 20%, 치명타 피해 50% 증가(재사용 대기 시간: 90초). 상시 효과: 치명타 확률 5%, 치명타 피해 10%, 적에게 주는 피해 5% 증가.',
    season: 1,
  },
  {
    name: '갈라진 땅',
    equipment: '엠블럼',
    grade: '전설',
    effect:
      '공격 시 50% 확률로 각성해 35초 동안 추가타 확률 30% 증가, 추가타 적중 시 다음 공격은 선행 타격의 18% 피해 추가(재사용 대기 시간: 90초). 상시 효과: 추가타 확률 12% 증가.',
    season: 1,
  },
];
