import { Rune } from '../../types/rune';

export const FighterRuneData: Rune[] = [
  {
    name: '도약',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 2. 격투가의 스톰프 킥 스킬에 변화를 준다. 착지 시, 공격 범위가 커지며 스킬의 이동 거리에 비례해 거리가 멀수록 적에게 더 큰 피해를 준다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '순발력',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 3. 격투가의 백 스탭 스킬에 변화를 준다. 백 스텝으로 적에게 피해를 주면, 적의 이동 속도가 느려진다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '열혈',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 5. 격투가의 섬머솔트 스킬에 변화를 준다. 발에 실은 화염의 기운을 검날의 형태로 발산해 전방의 적에게 범위 피해를 준다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '전진',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 2. 격투가의 스러스트 킥 스킬에 변화를 준다. 돌진 스킬로 변경되며 마지막 연속기 스킬, 콤보 스킬 피해량이 증가한다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '충돌',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 1. 격투가의 차징 피스트 스킬에 변화를 준다. 타격한 적을 멀리 날리고, 날아간 적이 충돌한 지점 주변의 적들에게 범위 피해를 주고 밀쳐낸다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '격파',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 4. 격투가의 버스트 펀치 스킬에 변화를 준다. 버스트 펀치 적중 시, 주변에 또 다른 적이 없다면 타겟에게 추가 공격을 가한다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '약점',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 1. 격투가의 차징 피스트 스킬에 변화를 준다. 차징 동작이 사라지며 카운터 시 약화 효과:약점 노출을 남긴다. 약점 노출이 부여된 적에게 가하는 다음 1회의 콤보 스킬은 방어력을 일부 무시하고 치명타 확률이 증가한다.',
    season: 1,
    job: '격투가',
  },
  {
    name: '강격격',
    equipment: '악세사리',
    grade: '전설',
    effect:
      '격투가 액티브 스킬: 5. 격투가의 섬머솔트 스킬에 변화를 준다. 연속기 스킬 동작이 사라지며, 섬머솔트가 카운터로 적중 시 재사용 대기시간이 감소한다.',
    season: 1,
    job: '격투가',
  },
];
