import { Rune } from '../../types/rune';

export const WeaponRuneData: Rune[] = [
  {
    name: '불길',
    equipment: '무기',
    grade: '전설',
    effect:
      '치명타 확률이 18% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 화상을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '결정',
    equipment: '무기',
    grade: '전설',
    effect:
      '추가타 확률이 18% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 빙결을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '뇌명',
    equipment: '무기',
    grade: '전설',
    effect:
      '강타 피해가 20% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 감전을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '독사+',
    equipment: '무기',
    grade: '전설',
    effect:
      '연타 피해가 20% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 중독을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '공포',
    equipment: '무기',
    grade: '전설',
    effect:
      '치명타 피해가 18% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 절망을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '집행자',
    equipment: '무기',
    grade: '전설',
    effect:
      '치유량이 20%, 적에게 주는 피해가 10% 증가한다. 공격 적중 시, (공격력×533%)의 지속 피해: 심판을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '야수+',
    equipment: '무기',
    grade: '전설',
    effect:
      '적에게 주는 피해가 20% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 상처를 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '밤+',
    equipment: '무기',
    grade: '전설',
    effect:
      '공격력이 20% 증가한다. 공격 적중 시, (공격력×356%)의 지속 피해: 두려움을 준다.(재사용 대기 시간: 10초)',
    season: 1,
  },
  {
    name: '투사+',
    equipment: '무기',
    grade: '전설',
    effect: '적에게 주는 피해가 33% 증가한다. 결함: 멀티히트 피해가 10% 감소한다.',
    season: 1,
  },
  {
    name: '은둔자+',
    equipment: '무기',
    grade: '전설',
    effect: '공격력이 33% 증가한다. 결함: 재사용 대기 시간 회복 속도가 9% 감소한다.',
    season: 1,
  },
  {
    name: '망각+',
    equipment: '무기',
    grade: '전설',
    effect: '공격력이 19% 증가한다. 기본 공격 적중 시, 모든 스킬의 재사용 대기 시간이 9% 감소한다.',
    season: 1,
  },
  {
    name: '서리바람+',
    equipment: '무기',
    grade: '전설',
    effect: '공격력이 20% 증가하고, 캐스팅 및 차지 속도가 25% 증가한다.',
    season: 1,
  },
  {
    name: '옛 마법사',
    equipment: '무기',
    grade: '전설',
    effect: '재사용 대기 시간 회복 속도가 29% 증가한다. 결함: 적에게 주는 피해가 10% 감소한다.',
    season: 1,
  },
  {
    name: '물결치는 날',
    equipment: '무기',
    grade: '전설',
    effect:
      '스킬 사용 시, 다음 기본 공격 적중 시 대상에게 (공격력×152%)의 피해를 추가로 입히고, 다음 1회의 기본 공격 속도가 10% 증가한다.',
    season: 1,
  },
  {
    name: '파괴자+',
    equipment: '무기',
    grade: '전설',
    effect: '공격력이 18% 증가하고, 무방비 피해가 48% 증가한다.',
    season: 1,
  },
  {
    name: '검무+',
    equipment: '무기',
    grade: '전설',
    effect:
      '누적: 공격이 적중할 때마다 10초 동안 공격력이 2%, 치명타 확률이 1% 증가한다. 해당 효과는 최대 10회까지 중첩되며 지속 시간은 스택마다 개별로 가진다.',
    season: 1,
  },
  {
    name: '무수한 궤적',
    equipment: '무기',
    grade: '전설',
    effect: '공격력이 10%, 기본 공격 속도가 30% 증가하며, 기본 공격 추가타 확률이 30% 증가한다.',
    season: 1,
  },
  {
    name: '마지막 자비',
    equipment: '무기',
    grade: '전설',
    effect:
      '공격력이 20% 증가한다. 남은 체력이 50% 이하인 적을 공격했을 경우, 10초 동안 공격력이 추가로 20% 증가한다.',
    season: 1,
  },
  {
    name: '끝없는 순환',
    equipment: '무기',
    grade: '전설',
    effect:
      '축적: 아군을 20회 회복시킨 이후, 다음 공격 적중 시 대상의 위치에 마법진을 펼쳐 9m 범위 내의 적들에게 0.5초마다 (공격력×21%)의 암흑 피해를 4.5초 동안 입힌다. 축적: 적을 20회 공격한 이후, 다음 아군 회복 시 대상의 위치에 마법진을 펼쳐 9m 범위 내의 아군의 체력을 0.5초마다 (공격력×0.5%)씩 4.5초 동안 회복한다. 축적 효과는 각각 0.5초에 한 번만 획득 할 수 있다.',
    season: 1,
  },
  {
    name: '종언+',
    equipment: '무기',
    grade: '전설',
    effect:
      '누적: 자신과 전투 중인 적이 처치되었을 경우, 공격력이 20초 동안 2% 증가한다(최대 10중첩, 지속 시간은 스택별로 개별). 공격력이 24% 증가한다.',
    season: 1,
  },
  {
    name: '영웅',
    equipment: '무기',
    grade: '전설',
    effect:
      '공격력, 연타 피해, 강타 피해, 콤보 피해, 스킬 피해, 치명타 피해, 멀티 히트 피해가 각각 4.3% 증가한다.',
    season: 1,
  },

  {
    name: '만 갈래 물길',
    equipment: '무기',
    grade: '신화',
    effect:
      '공격력이 15% 증가한다. 클래스 레벨 50 달성마다 추가로 공격력이 1%씩 증가(최대 20중첩). 모든 클래스로 사용 가능하며 캐릭터가 달성한 클래스 레벨을 기준으로 적용.',
    season: 1,
  },
  {
    name: '흰 까마귀',
    equipment: '무기',
    grade: '신화',
    effect:
      '공격/이동/스킬 사용 속도, 캐스팅 및 차지 속도, 재사용 대기 시간 회복 속도 10% 증가. 장비 +10 시 적에게 주는 피해 7% 증가, +15 시 공격력 7% 증가.',
    season: 1,
  },
  {
    name: '메아리치는 진노',
    equipment: '무기',
    grade: '신화',
    effect:
      '연타 적중 시 전방 광역 (공격력×110%) 피해와 (공격력×35%) 지속 피해: 빙결. 강타 적중 시 전방 광역 (공격력×110%) 피해와 (공격력×35%) 지속 피해: 화상. 공격력 5% 증가. 장비 +10, +15 시 각각 공격력 3% 추가 증가. (재사용 대기 시간: 각 8초)',
    season: 1,
  },
  {
    name: '무한',
    equipment: '무기',
    grade: '신화',
    effect:
      '기본 공격 사용 시 모든 스킬의 재사용 대기 시간이 9% 감소. 공격력 20% 증가 및 스킬 사용 시 5초 동안 공격 속도 12% 증가.',
    season: 1,
  },
];
